---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunActualNumberOfTreads
source: html/bc6d8d13-ed25-f9e4-e0fb-938c7d5db8fa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunActualNumberOfTreads Property

"Actual Number of Treads": Actual Number of Treads

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunActualNumberOfTreads { get; }
```